classification curriculum notes

    binary > understanding discrete data ... email, churn, products of customer, or click ad, disease, 
    
    multiclass > blood type, myers briggs

    structure    |       unstructured -
    labeled(sup)            unlabeled (unsup)
    discrete/cat        continuous
    binary.             multiclass

create obj | fit the train | predict

Vocab

Classifier: An algorithm that maps the input data to a specific category

Classification model: series of steps that take the patterns of input variables, generalize those patterns, and apply to new data in order to predict the class.

Feature: A feature, aka input/independent variable, is an individual measurable property of a phenomenon being observed.

Binary Classification: Classification with two possible outcomes. e.g. pass/fail

Multi class classification: Classification with more than two classes, where each sample is assigned to one and only one target label. e.g. Students' grade level in school (1st-12th)

Common Classification Algorithms

Logistic Regression (sklearn.linear_model.LogisticRegression)
Decision Tree (sklearn.tree.DecisionTreeClassifier)
    Naive Bayes (sklearn.naive_bayes.BernoulliNB) will be covered in ANOMALIES

K-Nearest Neighbors (sklearn.neighbors.KNeighborsClassifier)
https://www.kdnuggets.com/2016/01/implementing-your-own-knn-using-python.html

Random Forest (sklearn.ensemble.RandomForestClassifier)
Support Vector Machine (sklearn.svm.SVC)
Stochastic Gradient Descent (sklearn.linear_model.SGDClassifier)
AdaBoost (sklearn.ensemble.AdaBoostClassifier)
Bagging (sklearn.ensemble.BaggingClassifier)
Gradient Boosting (sklearn.ensemble.GradientBoostingClassifier)
See the sklearn docs on supervised methods for more.
https://scikit-learn.org/stable/supervised_learning.html#supervised-learning

# Methods of Data Acquisition

- read_clipboard 
        pd.read_clipboard

- read_excel # this might be necessary if pd.read_csv doesn't work
                !pip install xlrd
- read_csv
- read_sql(sql_query, connection_url) > ?? must have the required drivers installed??

In [1]:
# help(pd.read_clipboard(sep=))

In [2]:
,,,
# To talk to a mysql database:
python -m pip install pymysql mysql-connector
# the connection url string:
mysql+pymysql://USER:PASSWORD@HOST/DATABASE_NAME
,,,

In [ ]:
 # this might be necessary if pd.read_excel doesn't work
!pip install xlrd

Source: A Shared Google Sheet
 1 - Get the shareable link url: https://docs.google.com/spreadsheets/d/BLAHBLAHBLAH/edit#gid=NUMBER
 2 - Turn that into a CSV export URL: Replace /edit with /export; Add format=csv to the beginning of the query string. https://docs.google.com/spreadsheets/d/BLAHBLAHBLAH/export?format=csv&gid=NUMBER:
 3 - Pass it to pd.read_csv, which can take a URL.  pd.read_csv + sheet_name

In [ ]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head()

- Source: AWS S3

In [ ]:
# If the S3 file is private, you will need your S3 configurations setup properly.
df_s3 = pd.read_csv('https://s3.amazonaws.com/irs-form-990/index_2011.csv')
df_s3.head()

- Source: SQL

In [ ]:
import env

def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

df.head()

In [ ]:
# We will create a function that we can reference later to acquire the data:
def get_titanic_data():
    return pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

## We'll store this function in a file named acquire.py


# Data Prep

- Prepare Environment

In [47]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import acquire

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import MinMaxScaler

In [7]:
# from acquire import get_titanic_data
# #df = pd.read_csv("train.csv")
# df = get_titanic_data()
# #df = pd.read_csv('titanic.csv')
# df_sheet.head()

# Acquire Data

Summarize
info
describe
    dtypes
head/tail
value_counts
shape
isnull

In [35]:
import env

def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

# df.head()

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [11]:
df.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [36]:
df.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [38]:
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [39]:
df.tail()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
886,886,0,2,male,27.0,0,0,13.00,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.00,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.45,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.00,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.75,Q,Third,None,Queenstown,1

In [12]:
df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [13]:
df.fare.value_counts(bins=10, sort=False)

(-0.513, 51.233]      732
(51.233, 102.466]     106
(102.466, 153.699]     31
(153.699, 204.932]      2
(204.932, 256.165]     11
(256.165, 307.398]      6
(307.398, 358.63]       0
(358.63, 409.863]       0
(409.863, 461.096]      0
(461.096, 512.329]      3
Name: fare, dtype: int64

In [42]:
# df.age.value_counts(sort=False).sort_index()
df.age.value_counts(bins=10, sort=True)

(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.339, 8.378]       54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: age, dtype: int64

In [43]:
df.embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

In [14]:
df.embark_town.value_counts(dropna=False)

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [40]:
df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [41]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
passenger_id,891.0,445.000000,257.353842,0.00,222.5000,445.0000,667.5,890.0000
survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
sibsp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292
alone,891.0,0.602694,0.489615,0.00,0.0000,1.0000,1.0,1.0000

In [15]:
df.embark_town.fillna('Other', inplace=True)

In [16]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Other            2
Name: embark_town, dtype: int64

# Prepare Data

- drop columns
- fillna
- split (aka train_test_split into train/test)
- impute mean, mode, median: SimpleImputer
- integer encoding: LabelEncoder
- one hot encoding: OneHotEncoder
- scale

- Data Preparation

In [22]:
df.drop(columns=['deck'], inplace=True)

In [23]:
df.head(2)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,2,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,0,First,Cherbourg,0

In [45]:
df.fillna(np.nan, inplace=True)

In [48]:
train, test = train_test_split(df, train_size=.8, random_state=123)

# Impute mean, mode, median using SimpleImputer

In [50]:
train.embarked.value_counts(dropna=False)

S      515
C      128
Q       67
NaN      2
Name: embarked, dtype: int64

## WHERE I LEFT OFF 10-22

In [ ]:
imp_mode = SimpleImputer(missing_values=np.nan, strategy='most_frequent')

imp_mode.fit(train[['embarked']])

train['embarked'] = imp_mode.transform(train[['embarked']])

test['embarked'] = imp_mode.transform(test[['embarked']])

-Feature Encoding: Objects to Numeric

  1 integer encoding 
    2 one hot encoder

In [30]:
embarked_array = np.array(df.embarked)
embarked_array[0:5]

array([2, 0, 2, 2, 2])

In [31]:
embarked_array = embarked_array.reshape(len(embarked_array), 1)

In [34]:
# cant get this to work yet
# ohe = OneHotEncoder(sparse=False, categories='auto')

In [ ]:
# embarked_ohe = ohe.fit_transform(embarked_array)
# embarked_ohe

In [24]:
df.embarked.head(10)

0    2
1    0
2    2
3    2
4    2
5    1
6    2
7    2
8    2
9    0
Name: embarked, dtype: int64

In [25]:
df.embarked.value_counts(dropna=False)

2    644
0    168
1     77
3      2
Name: embarked, dtype: int64

In [27]:
encoder = LabelEncoder()

df.embarked.fillna('Unknown', inplace=True)

encoder.fit(df.embarked)
df.embarked = encoder.transform(df.embarked)

df.embarked.head(10)

0    2
1    0
2    2
3    2
4    2
5    1
6    2
7    2
8    2
9    0
Name: embarked, dtype: int64

In [ ]:
# test.embarked = int_encoder.transform(test.embarked)
# embarked_array = np.array(test.embarked).reshape(len(test_embarked), 1)

# embarked_test_ohe[0:5]

- Missing values

In [28]:
df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
dtype: int64

In [44]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
passenger_id,891.0,445.000000,257.353842,0.00,222.5000,445.0000,667.5,890.0000
survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
sibsp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292
alone,891.0,0.602694,0.489615,0.00,0.0000,1.0000,1.0,1.0000

- Splitting